TEXTS = {
    "BUTTON_BACK":
        "⬅️ Назад",
    "BUTTON_PAGE_BACK":
        "◀️ Назад",
    "BUTTON_PAGE_NEXT":
        "Далее ▶️",
    "BUTTON_SEARCH":
        "🔍 Поиск",
    "BUTTON_CLEAR":
        "❌ Очистить поиск",
    "BUTTON_REFRESH":
        "🔄 Обновить",
    "BUTTON_PAY":
        "💳 Оплатить",
    "BUTTON_CANCEL":
        "❌ Отменить",
    "BUTTON_ORDER_PAY":
        "✅ Подтвердить",
    "BUTTON_ORDER_CANCEL":
        "❌ Отменить",
    "MESSAGE_MENU":
        "Добро пожаловать!\n\n"
        "Наш Darknet Маркетплейс для покупки ПАВ представляет упрощенную версию для Telegram в виде бота, на случай затруднений в работе сайта из-за DDOS атак.\n\n"
        "Здесь вы можете купить товар просто, анонимно и безопасно от проверенных площадкой и временем поставщиков.\n\n"
        "В боте представлен не весь ассортимент, если интересующий вас Товар или Вес отсутствует, обратитесь к Оператору.\n\n"
        "Если бот не отвечает, перезапустите командой /start",
    "BUTTON_MARKETPLACE":
        "🤩 МАРКЕТПЛЕЙС 🤩",
    "BUTTON_OPT":
        "📦 Прайс на опт",
    "BUTTON_WORK":
        "💼 Работа",
    "BUTTON_RULES":
        "📜 Правила",
    "BUTTON_PROFILE":
        "👤 Профиль",
    "BUTTON_SUPPORT":
        "🗿 Оператор",
    "BUTTON_ORDERS":
        "📚 Заказы",
    "BUTTON_CHAT":
        "😍 ЧАТ КЛИЕНТОВ 😍",
    "MESSAGE_MARKETPLACE_SELECT_CITY":
        "🗺 Выберите город:",
    "MESSAGE_MARKETPLACE_SELECT_PRODUCT":
        "🛒 Выберите товар:",
    "MESSAGE_MARKETPLACE_SELECT_WEIGHT":
        "⚖️ Выберите вес:",
    "MESSAGE_MARKETPLACE_SELECT_TYPE":
        "💡 Выберите тип:",
    "MESSAGE_MARKETPLACE_SELECT_DISTRICT":
        "📍 Выберите район:",
    "MESSAGE_MARKETPLACE_SELECT_PAYMENT":
        "💳 Выберите способ оплаты:",
    "MESSAGE_MARKETPLACE_ENTER_CITY":
        "🔍 Введите название города:",
    "MESSAGE_MARKETPLACE_ENTER_DISTRICT":
        "🔍 Введите название района:",
    "MESSAGE_MARKETPLACE_ENTER_RESULTS":
        "🔍 Результаты поиска:",
    "MESSAGE_MARKETPLACE_NOT_FOUND_CITY":
        "❌ Город не найден!",
    "MESSAGE_MARKETPLACE_NOT_FOUND_DISTRICT":
        "❌ Район не найден!",
    "MESSAGE_MARKETPLACE_NOT_DISTRICT":
        "По городу",
    "MESSAGE_MARKETPLACE_NOT_WALLET":
        "❌ Этот способ оплаты сейчас не доступен, попробуйте позже или выберите другой способ оплаты!",
    "MESSAGE_MARKETPLACE_CONFIRM_ORDER":
        "✅ Подтвердите заказ\n\n"
        "🗺 <b>Город:</b> {city}\n"
        "🛒 <b>Товар:</b> {product}\n"
        "⚖️ <b>Вес:</b> {weight}\n"
        "💡 <b>Тип:</b> {type}\n"
        "📍 <b>Район:</b> {district}\n"
        "💰 <b>Цена:</b> {price}₽",
    "MESSAGE_MARKETPLACE_CONFIRM_PAYMENT":
        "🆔 <b>Заказ:</b> {order_id}\n"
        "🗺 <b>Город:</b> {city}\n"
        "🛒 <b>Товар:</b> {product}\n"
        "⚖️ <b>Вес:</b> {weight}\n"
        "💡 <b>Тип:</b> {type}\n"
        "📍 <b>Район:</b> {district}\n"
        "💰 <b>Цена:</b> {price}₽\n"
        "💳 <b>Способ оплаты:</b> {payment_method}\n"
        "💵 <b>Сумма:</b> {payment_price} {currency}\n"
        "💱 <b>Реквизиты:</b> <code>{payment_details}</code>\n\n"
        "Отправьте точную сумму на указанный адрес и добавьте комментарий к платежу: <code><b>{order_id}</b></code>, чтобы мы могли точно идентифицировать вашу оплату.",
    "MESSAGE_MARKETPLACE_CONFIRM_PAYMENT_CANCELLED":
        "❌ <b>Заказ:</b> {order_id} Отменен\n\n"
        "Если это ошибка, обратитесь к Оператору.",
    "MESSAGE_MARKETPLACE_CONFIRM_PAYMENT_PAID":
        "✅ <b>Заказ:</b> {order_id} Оплачен\n\n"
        "К сожалению данный клад больше недоступен, обратитесь к Оператору для замены.",
    "MESSAGE_OPT":
        "📦 <b>Прайс на опт:</b>\n\n"
        "Для ваших клиентов мы готовы предложить широчайший ассортимент самых разных ПАВ. Обратите внимание, что мы стараемся держать примерно такие же цены и на мелкий опт. Все для того, что бы ваш магазин мог хорошо зарабатывать. Товар отгружаем во всех крупных городах.\n\n"
        "Прайс и минимальный вес для отправки товара:\n\n"
        "▫️ Шишки - 5 000/10 000 г 510/480 ₽/г (Минимум 200 г)\n"
        "▫️ Гашиш - 5 000/10 000 г 530/510 ₽/г (Минимум 200 г)\n"
        "▫️ A-PVP Кристалл - 5 000/10 000 г 530/510 ₽/г (Минимум 200 г)\n"
        "▫️ Мефедрон Кристалл - 5 000/10 000 г 570/550 ₽/г (Минимум 200 г)\n"
        "▫️ Амфетамин VHQ - 500/1 000 г 1 800/1 600 ₽/г (Минимум 100 г)\n"
        "▫️ Метамфетамин VHQ - 500/1 000 г 2 000/1 800 ₽/г (Минимум 100 г)\n"
        "▫️ Марки ЛСД 250/300 мкг - 5 000/10 000 шт 310/290 ₽/шт (Минимум 200 шт)\n"
        "▫️ Экстази Ассорти - 5 000/10 000 шт 380/360 ₽/шт (Минимум 200 шт)\n"
        "▫️ МДМА Кристалл - 500/1 000 г 1 390/1 290 ₽/г (Минимум 100 г)\n"
        "▫️ Кокаин VHQ - 500/1 000 г 2 100/1 900 ₽/г (Минимум 100 г)\n"
        "▫️ Героин VHQ - 500/1 000 г 2 300/2 100 ₽/г (Минимум 100 г)\n\n"
        "Указанные выше цены в основном для Москвы и Санкт-Петербурга. В других регионах клады могут иметь другую стоимость. Доставка согласовывается и оплачивается отдельно. Для связи обращаться к Оператору.",
    "MESSAGE_WORK":
        "📝 <b>Заполни анкету</b>\n\n"
        "1. Возраст:\n"
        "2. Город:",
    "MESSAGE_WORK_ACCEPTED":
        "✅ Ты нам нужен!\n"
        "🔗 Свяжись с Оператором, пиши сразу свой возраст и город!",
    "MESSAGE_WORK_REJECTED":
        "❌ Ты нам не подходишь!",
    "MESSAGE_RULES":
        "📜 <b>Правила Маркетплейса</b>\n\n"
        "1. Возврат средств.\n"
        "1.1. Возврат средств за оплаченный товар не предусмотрен ни при каких обстоятельствах.\n\n"
        "2. Условия перезаклада.\n"
        "2.1. Перезаклад возможен только при наличии 5 и более оплаченных заказов.\n"
        "2.2. Для запроса перезаклада:\n"
        "  ▫️ Свяжитесь с Оператором.\n"
        "  ▫️ Четко опишите ситуацию без оскорблений.\n"
        "  ▫️ Приложите фотографию места поиска.\n"
        "2.3. Перезаклад не предоставляется в случаях:\n"
        "  ▫️ Попытки обмануть Оператора.\n"
        "  ▫️ Предоставления доступа к адресу третьим лицам.\n"
        "  ▫️ Удаления переписки с Оператором с обеих сторон.\n"
        "  ▫️ Нарушения порядка обращения.\n"
        "  ▫️ Обращения после истечения гарантийного срока.\n"
        "  ▫️ Фиксации на фото и видео значительного нарушения места поиска (раскопки, беспорядок) до обращения к Оператору.\n"
        "2.4. Перезаклад выдается только один раз. Повторный перезаклад невозможен.\n"
        "2.5. При получении перезаклада персональная скидка обнуляется.\n"
        "2.6. Предоставьте Оператору любую дополнительную запрошенную информацию для решения ситуации.\n\n"
        "3. Процедура обращения к Оператору.\n"
        "3.1. Все претензии (ненаход, недовес) первоначально направляются исключительно Оператору.\n"
        "3.2. Публикация жалоб в общих чатах до обращения к Оператору означает отказ от помощи и автоматически исключает возможность перезаклада.\n"
        "3.3. В случае недовеса предоставьте фото или видео фиксацию взвешивания товара на весах.\n"
        "3.4. При обращении пишите все в одном сообщении, избегайте спама и ожидайте ответа Оператора в порядке очереди.\n\n"
        "4. Гарантии и ответственность.\n"
        "4.1. Сервис гарантирует сохранность клада в течение 24 часов с момента выдачи описания места.\n"
        "4.2. По истечении 24 часов ответственность Маркетплейса за сохранность клада прекращается. Отсутствие обращений в этот срок означает успешное выполнение заказа.\n"
        "4.3. Маркетплейс оставляет за собой право оказывать помощь в поисках по истечении гарантийного срока по своему усмотрению.\n\n"
        "5. Заключение.\n"
        "5.1. Незнание настоящих правила не освобождает от ответственности и не является основанием для их несоблюдения.\n",
    "MESSAGE_PROFILE":
        "👤 <b>Профиль</b>\n\n"
        "▫️ ID: <code>{user_id}</code>\n"
        "▫️ Имя: {name}\n"
        "▫️ Кол-во заказов: {orders_count}\n"
        "▫️ Сумма заказов: {total_spent}₽\n"
        "▫️ Персональная скидка: {discount}%",
    "MESSAGE_ORDERS":
        "📚 <b>Заказы</b>\n\n",
    "MESSAGE_ORDERS_EMPTY":
        "У вас пока нет заказов",
    "MESSAGE_ORDER_ITEM":
        "🆔 <b>Заказ:</b> {order_id}\n"
        "🗺 <b>Город:</b> {city}\n"
        "🛒 <b>Товар:</b> {product}\n"
        "⚖️ <b>Вес:</b> {weight}\n"
        "💡 <b>Тип:</b> {type}\n"
        "📍 <b>Район:</b> {district}\n"
        "💰 <b>Цена:</b> {price}₽\n"
        "💳 <b>Способ оплаты:</b> {payment_method}\n"
        "💵 <b>Сумма:</b> {payment_price} {currency}\n"
        "💱 <b>Реквизиты:</b> <code>{payment_details}</code>\n"
        "📎 <b>Статус:</b> {status}\n"
        "⏱️ <b>Дата:</b> {date}\n\n",
    "MESSAGE_CHAT":
        "😍 <b>Чат клиентов</b>\n\n"
        "Чат клиентов доступен только после нескольких заказов.",
    "MESSAGE_ADMIN_PASSWORD":
        "🔑 Введите пароль:",
    "MESSAGE_ADMIN_SEARCH":
        "🔍 Введите текст:",
    "MESSAGE_ADMIN_MENU":
        "🗿 Админ-панель:",
    "BUTTON_ADMIN_LOGS":
        "👁‍🗨 Логи",
    "BUTTON_ADMIN_PROFILES":
        "👤 Профили",
    "BUTTON_ADMIN_ORDERS":
        "📚 Заказы",
    "BUTTON_ADMIN_EXIT":
        "❌ Выход",
    "MESSAGE_ADMIN_LOGS":
        "👁‍🗨 Логи бота:\n\n<code>{logs}</code>",
    "MESSAGE_ADMIN_LOGS_EMPTY":
        "Логов нет",
    "MESSAGE_ADMIN_PROFILES":
        "👤 Профили:",
    "MESSAGE_ADMIN_PROFILE_DETAIL":
    "👤 <b>Профиль пользователя</b>\n\n"
    "▫️ ID: <code>{user_id}</code>\n"
    "▫️ Username: {username}\n"
    "▫️ Имя: {name}\n"
    "▫️ Кол-во заказов: {orders_count}\n"
    "▫️ Сумма заказов: {total_spent}₽\n"
    "▫️ Персональная скидка: {discount}%\n"
    "▫️ Дата регистрации: {registration_date}",
    "MESSAGE_ADMIN_ORDERS":
        "📚 Заказы:",
    "MESSAGE_ADMIN_ORDER_DETAIL":
        "🆔 <b>Заказ:</b> {order_id}\n"
        "🗺 <b>Город:</b> {city}\n"
        "🛒 <b>Товар:</b> {product}\n"
        "⚖️ <b>Вес:</b> {weight}\n"
        "💡 <b>Тип:</b> {type}\n"
        "📍 <b>Район:</b> {district}\n"
        "💰 <b>Цена:</b> {price}₽\n"
        "💳 <b>Способ оплаты:</b> {payment_method}\n"
        "💵 <b>Сумма:</b> {payment_price} {currency}\n"
        "💱 <b>Реквизиты:</b> <code>{payment_details}</code>\n"
        "📎 <b>Статус:</b> {status}\n"
        "⏱️ <b>Дата:</b> {date}",
    "MESSAGE_ERROR":
        "❌ Ошибка!"
}